#+title: Emacs config
#+author O. George
#+BABEL: :cache no
#+PROPERTY: header-args:emacs-lisp :tangle init.el
[[https://github.com/horhik/dotfiles][â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘
â–‘â–‘â–ˆâ–‘â–ˆâ–‘â–ˆâ–€â–ˆâ–‘â–ˆâ–€â–„â–‘â–ˆâ–‘â–ˆâ–‘â–€â–ˆâ–€â–‘â–ˆâ–‘â–ˆâ–‘â–€â–‘â–ˆâ–€â–€â–‘â–‘â–‘â–‘
â–‘â–‘â–ˆâ–€â–ˆâ–‘â–ˆâ–‘â–ˆâ–‘â–ˆâ–€â–„â–‘â–ˆâ–€â–ˆâ–‘â–‘â–ˆâ–‘â–‘â–ˆâ–€â–„â–‘â–‘â–‘â–€â–€â–ˆâ–‘â–‘â–‘â–‘
â–‘â–‘â–€â–‘â–€â–‘â–€â–€â–€â–‘â–€â–‘â–€â–‘â–€â–‘â–€â–‘â–€â–€â–€â–‘â–€â–‘â–€â–‘â–‘â–‘â–€â–€â–€â–‘â–‘â–‘â–‘
â–‘â–‘â–ˆâ–€â–„â–‘â–ˆâ–€â–ˆâ–‘â–€â–ˆâ–€â–‘â–ˆâ–€â–€â–‘â–€â–ˆâ–€â–‘â–ˆâ–‘â–‘â–‘â–ˆâ–€â–€â–‘â–ˆâ–€â–€â–‘â–‘
â–‘â–‘â–ˆâ–‘â–ˆâ–‘â–ˆâ–‘â–ˆâ–‘â–‘â–ˆâ–‘â–‘â–ˆâ–€â–€â–‘â–‘â–ˆâ–‘â–‘â–ˆâ–‘â–‘â–‘â–ˆâ–€â–€â–‘â–€â–€â–ˆâ–‘â–‘
â–‘â–‘â–€â–€â–‘â–‘â–€â–€â–€â–‘â–‘â–€â–‘â–‘â–€â–‘â–‘â–‘â–€â–€â–€â–‘â–€â–€â–€â–‘â–€â–€â–€â–‘â–€â–€â–€â–‘â–‘
â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘â–‘]]

** Emojies
#+begin_src emacs-lisp
;; Emojies
(use-package emojify
  :hook (after-init . global-emojify-mode)
  :config
  (setq emojify-emoji-set "twemoji-v2")
  (setq emojify-set-emoji-styles 'unicode)
  (setq emojify-display-style 'unicode))
#+end_src

#+RESULTS:
| org-roam-mode | global-emojify-mode | x-wm-set-size-hint | tramp-register-archive-file-name-handler | magit-maybe-define-global-key-bindings |

** Rainbow brakets
#+begin_src emacs-lisp
  (use-package highlight-parentheses
  :ensure t
  :init
  (global-highlight-parentheses-mode t)
  (show-paren-mode t))			;
  (use-package rainbow-delimiters
    :hook (prog-mode . rainbow-delimiters-mode))
#+end_src

#+RESULTS:
| rainbow-delimiters-mode | (lambda nil (display-line-numbers-mode 1) (setq display-line-numbers 'relative)) |

* Org mode
  #+begin_src emacs-lisp
	  (defun org-mode-setup() 
	  (org-indend-mode) 
	  (variable-pitch-mode 1) 
	  (auto-fill-mode 0) 
	  (visual-line-mode 1) 
	  (setq evil-auto indent 1)) 
	  (use-package 
	  org 
	  :config)

	  (use-package 
	  org-bullets 
	  :after org
	  :hook
	    (org-mode . org-bullets-mode))
	  (set-face-attribute 'org-document-title nil :font "hack" :weight 'bold :height 1.3)
	  (dolist (face '((org-level-1 . 1.3)
		      (org-level-2 . 1.2)
		      (org-level-3 . 1.05)
		      (org-level-4 . 1.0)
		      (org-level-5 . 1.1)
		      (org-level-6 . 1.1)
		      (org-level-7 . 1.1)
		      (org-level-8 . 1.1)))
	(set-face-attribute (car face) nil :font "hack" :weight 'bold :height (cdr face)))
	(require 'org-indent)
    (set-face-attribute 'org-block nil :foreground nil :inherit 'fixed-pitch :font "mononoki" )
    (set-face-attribute 'org-table nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-formula nil  :inherit 'fixed-pitch)
    (set-face-attribute 'org-code nil   :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-indent nil :inherit '(org-hide fixed-pitch))
    (set-face-attribute 'org-verbatim nil :inherit '(shadow fixed-pitch))
    (set-face-attribute 'org-special-keyword nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-meta-line nil :inherit '(font-lock-comment-face fixed-pitch))
    (set-face-attribute 'org-checkbox nil :inherit 'fixed-pitch)

    ;; Get rid of the background on column views
    (set-face-attribute 'org-column nil :background nil)
    (set-face-attribute 'org-column-title nil :background nil)
    (setq org-src-fontify-natively t)
   (defun my/visual-fill ()
    (setq visual-fill-column-width 140
        visual-fill-column-center-text t)
     (visual-fill-column-mode 1))
    (use-package visual-fill-column
     :defer t
     :hook (org-mode . my/visual-fill))
  #+end_src

  #+RESULTS:
  | my/visual-fill | org-bullets-mode | #[0 \301\211\207 [imenu-create-index-function org-imenu-get-tree] 2] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-show-all append local] 5] | #[0 \300\301\302\303\304$\207 [add-hook change-major-mode-hook org-babel-show-result-all append local] 5] | org-babel-result-hide-spec | org-babel-hide-all-hashes | (lambda nil (display-line-numbers-mode 0)) |
